БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияДенежныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ДвиженияДенежныхСредств/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Выполняет приходные документа движения по регистру накопления "ДвиженияДенежныхСредств".
//
// Параметры:
//  ПараметрыДокумента	 - Структура			 - структура с необходимыми параметрами документа
//  НаборЗаписей		 - РегистрНакопленияНаборЗаписей - набор записей по регистру "Движения денежных средств"
//  Приход				 - Булево						 - сли Истина, то выполняется операция прихода, если Ложь - расхода денежных средств.
//  Отказ				 - Булево						 - признак отмены проведения документа.
//
Процедура СформироватьДвиженияПоШапкеДокумента(ПараметрыДокумента,НаборЗаписей, Приход = Истина, Отказ = Ложь) Экспорт
	
	Движение = НаборЗаписей.Добавить();
	Движение.Период = ПараметрыДокумента.Дата;
	// Заполнение статьи ДДС и Кассы
	ЗаполнитьЗначенияСвойств(Движение,ПараметрыДокумента); 
	
	Движение.Сумма = ПараметрыДокумента.СуммаДокумента;
	Движение.ПриходРасход = ?(Приход, Перечисления.ВидыДвиженийПриходРасход.Приход, Перечисления.ВидыДвиженийПриходРасход.Расход);
	
	// Для совпадения при перепроведении старых документов после БИТ.УМЦ 2.0.47.22/2.1.23.17 (и дочерних конфигураций).
	Если Движение.Касса = Справочники.ЭквайринговыеТерминалы.ПустаяСсылка() Тогда
		Движение.Касса = Справочники.Кассы.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
